In [1]:
import pandas as pd

In [2]:
data = pd.read_csv("clean_data.csv")

/home/rebecca/anaconda3/lib/python3.6/site-packages/IPython/core/interactiveshell.py:3058: DtypeWarning: Columns (1,3,4) have mixed types. Specify dtype option on import or set low_memory=False.
  interactivity=interactivity, compiler=compiler, result=result)

In [3]:
data

,Unnamed: 0,bike_id,end_time,start_lat,start_lon,start_station_id,start_time
0,0,3350.0,4/23/15 7:45,39.9501,-75.1447,3046.0,4/23/15 7:44
1,1,3350.0,4/23/15 7:46,39.9501,-75.1447,3046.0,4/23/15 7:45
2,2,3282.0,4/23/15 7:48,39.9644,-75.18,3057.0,4/23/15 7:46
3,3,3350.0,4/23/15 10:14,39.9538,-75.1637,3004.0,4/23/15 10:13
4,4,2716.0,4/23/15 10:17,39.9538,-75.1637,3004.0,4/23/15 10:14
...,...,...,...,...,...,...,...
3123632,275192,3303,10/1/2019 1:18,39.9422,-75.1775,3012.0,9/30/2019 23:52
3123633,275193,5194,10/1/2019 0:06,39.9644,-75.1799,3057.0,9/30/2019 23:52
3123634,275194,5219,9/30/2019 23:56,39.9626,-75.1617,3059.0,9/30/2019 23:55
3123635,275195,6694,10/1/2019 0:07,39.9626,-75.1617,3059.0,9/30/2019 23:56
3123636,275196,19946,10/1/2019 0:05,39.9323,-75.1815,3053.0,9/30/2019 23:59

In [4]:
data = data.drop(['Unnamed: 0'], axis=1)

In [5]:
data['start_time']

0             4/23/15 7:44
1             4/23/15 7:45
2             4/23/15 7:46
3            4/23/15 10:13
4            4/23/15 10:14
                ...
3123632    9/30/2019 23:52
3123633    9/30/2019 23:52
3123634    9/30/2019 23:55
3123635    9/30/2019 23:56
3123636    9/30/2019 23:59
Name: start_time, Length: 3123637, dtype: object

In [6]:
data['start_time'] =  pd.to_datetime(data['start_time'])

In [7]:
data.start_time

0         2015-04-23 07:44:00
1         2015-04-23 07:45:00
2         2015-04-23 07:46:00
3         2015-04-23 10:13:00
4         2015-04-23 10:14:00
                  ...
3123632   2019-09-30 23:52:00
3123633   2019-09-30 23:52:00
3123634   2019-09-30 23:55:00
3123635   2019-09-30 23:56:00
3123636   2019-09-30 23:59:00
Name: start_time, Length: 3123637, dtype: datetime64[ns]

In [8]:
data['hour_of_day'] = [r.hour for r in pd.to_datetime(data.start_time)]

In [9]:
data.to_csv("clean_data_2.csv")

In [10]:
df = pd.read_csv('clean_data_2.csv')

In [11]:
df['hour_of_day'] = [r.hour for r in pd.to_datetime(df.start_time)]
df['month'] = [r.month for r in pd.to_datetime(df.start_time)]

In [12]:
df.hour_of_day

0           7
1           7
2           7
3          10
4          10
           ..
3123632    23
3123633    23
3123634    23
3123635    23
3123636    23
Name: hour_of_day, Length: 3123637, dtype: int64

In [13]:
df.month

0          4
1          4
2          4
3          4
4          4
          ..
3123632    9
3123633    9
3123634    9
3123635    9
3123636    9
Name: month, Length: 3123637, dtype: int64

In [14]:
df = df.drop(['end_time', 'Unnamed: 0'], axis=1)

In [15]:
df

,bike_id,start_lat,start_lon,start_station_id,start_time,hour_of_day,month
0,3350,39.9501,-75.1447,3046.0,2015-04-23 07:44:00,7,4
1,3350,39.9501,-75.1447,3046.0,2015-04-23 07:45:00,7,4
2,3282,39.9644,-75.18,3057.0,2015-04-23 07:46:00,7,4
3,3350,39.9538,-75.1637,3004.0,2015-04-23 10:13:00,10,4
4,2716,39.9538,-75.1637,3004.0,2015-04-23 10:14:00,10,4
...,...,...,...,...,...,...,...
3123632,3303,39.9422,-75.1775,3012.0,2019-09-30 23:52:00,23,9
3123633,5194,39.9644,-75.1799,3057.0,2019-09-30 23:52:00,23,9
3123634,5219,39.9626,-75.1617,3059.0,2019-09-30 23:55:00,23,9
3123635,6694,39.9626,-75.1617,3059.0,2019-09-30 23:56:00,23,9
3123636,19946,39.9323,-75.1815,3053.0,2019-09-30 23:59:00,23,9

In [35]:
weather = pd.read_csv('weather_data.csv')

In [36]:
weather.STATION.unique()

array(['USW00013739'], dtype=object)

In [37]:
weather.columns.values

array(['STATION', 'NAME', 'DATE', 'AWND', 'PGTM', 'PRCP', 'PSUN', 'SNOW',
       'SNWD', 'TAVG', 'TMAX', 'TMIN', 'TSUN', 'WDF2', 'WDF5', 'WESD',
       'WSF2', 'WSF5', 'WT01', 'WT02', 'WT03', 'WT04', 'WT05', 'WT06',
       'WT08', 'WT09'], dtype=object)

In [38]:
weather = weather.drop(['STATION','WESD','WT06','WT08','WT09','NAME','WSF5','WSF2', 'WDF2', 'WDF5', 'WT05', 'PGTM', 'WT02'], axis=1)

In [39]:
weather.columns.values

array(['DATE', 'AWND', 'PRCP', 'PSUN', 'SNOW', 'SNWD', 'TAVG', 'TMAX',
       'TMIN', 'TSUN', 'WT01', 'WT03', 'WT04'], dtype=object)

In [43]:
weather.PSUN.describe()

count    6.0
mean     0.0
std      0.0
min      0.0
25%      0.0
50%      0.0
75%      0.0
max      0.0
Name: PSUN, dtype: float64

In [45]:
weather = weather.drop(['PSUN'], axis=1)

In [46]:
weather

,DATE,AWND,PRCP,SNOW,SNWD,TAVG,TMAX,TMIN,TSUN,WT01,WT03,WT04
0,2015-03-01,4.92,0.52,0.4,0.0,NaN,32,21,NaN,1.0,NaN,1.0
1,2015-03-02,12.08,0.00,0.0,0.0,NaN,40,29,NaN,1.0,NaN,NaN
2,2015-03-03,8.05,0.61,0.1,0.0,NaN,34,25,NaN,1.0,NaN,1.0
3,2015-03-04,5.82,0.49,0.0,0.0,NaN,43,33,NaN,1.0,NaN,NaN
4,2015-03-05,10.74,0.78,7.5,0.0,NaN,40,20,NaN,1.0,NaN,1.0
...,...,...,...,...,...,...,...,...,...,...,...,...
1707,2019-11-02,6.93,0.00,0.0,0.0,45.0,54,36,NaN,NaN,NaN,NaN
1708,2019-11-03,8.50,0.00,0.0,0.0,47.0,53,38,NaN,NaN,NaN,NaN
1709,2019-11-04,5.59,0.00,0.0,0.0,47.0,59,35,NaN,NaN,NaN,NaN
1710,2019-11-05,5.82,0.00,0.0,0.0,52.0,63,43,NaN,NaN,NaN,NaN
1711,2019-11-06,NaN,0.00,0.0,0.0,52.0,57,42,NaN,NaN,NaN,NaN

In [49]:
weather.TSUN.unique()

array([nan,  0.])

In [50]:
weather = weather.drop(['TSUN'], axis=1)

In [51]:
weather

            DATE   AWND  PRCP  SNOW  SNWD  TAVG  TMAX  TMIN  WT01  WT03  WT04
0     2015-03-01   4.92  0.52   0.4   0.0   NaN    32    21   1.0   NaN   1.0
1     2015-03-02  12.08  0.00   0.0   0.0   NaN    40    29   1.0   NaN   NaN
2     2015-03-03   8.05  0.61   0.1   0.0   NaN    34    25   1.0   NaN   1.0
3     2015-03-04   5.82  0.49   0.0   0.0   NaN    43    33   1.0   NaN   NaN
4     2015-03-05  10.74  0.78   7.5   0.0   NaN    40    20   1.0   NaN   1.0
...          ...    ...   ...   ...   ...   ...   ...   ...   ...   ...   ...
1707  2019-11-02   6.93  0.00   0.0   0.0  45.0    54    36   NaN   NaN   NaN
1708  2019-11-03   8.50  0.00   0.0   0.0  47.0    53    38   NaN   NaN   NaN
1709  2019-11-04   5.59  0.00   0.0   0.0  47.0    59    35   NaN   NaN   NaN
1710  2019-11-05   5.82  0.00   0.0   0.0  52.0    63    43   NaN   NaN   NaN
1711  2019-11-06    NaN  0.00   0.0   0.0  52.0    57    42   NaN   NaN   NaN

[1712 rows x 11 columns]

In [52]:
weather = weather.rename(columns={'AWND': 'AVG_WND_SPEED', 'SNWD': 'SNOW_DEPTH', 'WT01': 'FOG', 'WT03': 'THUNDER', 'WT04': 'SLEET_OR_HAIL'})

In [53]:
weather.columns.values

array(['DATE', 'AVG_WND_SPEED', 'PRCP', 'SNOW', 'SNOW_DEPTH', 'TAVG',
       'TMAX', 'TMIN', 'FOG', 'THUNDER', 'SLEET_OR_HAIL'], dtype=object)

In [54]:
weather.to_csv('weather_clean.csv')